package jpl.ch12.ex02;

public class Answer {
/***********************************************
 *Q：次の状態は、どのような方法でプログラマに知らせるべきかを決めなさい。
 *
 * PassengerVehicleオブジェクト定員を負の数に設定しようとした。
 * ⇒IllegalArgumentExceptionをスローする。
 * オブジェクトがその初期値を設定するのに使用する設定ファイルに、文法エラーが見つかった。
 * ⇒例外クラスを作成しスローする。
 * プログラマが指定した単語を文字列の配列から検索するメソッドが、その単語を発見できない。
 * ⇒例外クラスを作成しスローする。
 * openメソッドへ指定されたファイルが存在しない。
 * ⇒FileNotFoundExceptionをスローする。
 * openメソッドへ指定されたファイルは存在するが、セキュリティにより使用できない。
 * ⇒例外クラスを作成しスローする。
 * リモートのサーバプロセスにネットワークコネクションを確立しようとするが、リモートのマシンと接続できない。
 * ⇒例外クラスを作成しスローする。
 * リモートのサーバプロセスとのやりとりの最中に、ネットワークコネクションが切れる。
 * ⇒例外クラスを作成しスローする。
 */
}
